DSU/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.ДолговыеОбязательства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыДолговыхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжникСписания</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаСписания</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжникУвеличения</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУвеличения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУвеличения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвертироватьКурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

DSU/src/Enums/ВидыДолговыхОпераций/ВидыДолговыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДолговыхОпераций</name>
  <enumValues>
    <name>СписаниеДолга</name>
  </enumValues>
  <enumValues>
    <name>УвеличениеДолга</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолга</name>
  </enumValues>
</mdclass:Enum>

DSU/src/Documents/КорректировкаДолга/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидОперации = Перечисления.ВидыДолговыхОпераций.СписаниеДолга Тогда
		Движение = Движения.ДолговыеОбязательства.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, ПолучитьДанныеДолга(Ссылка, "Списания"));
	ИначеЕсли ВидОперации = Перечисления.ВидыДолговыхОпераций.УвеличениеДолга Тогда
		Движение = Движения.ДолговыеОбязательства.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, ПолучитьДанныеДолга(Ссылка, "Увеличения"));
	Иначе
		Движение = Движения.ДолговыеОбязательства.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, ПолучитьДанныеДолга(Ссылка, "Списания"));
		Движение = Движения.ДолговыеОбязательства.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, ПолучитьДанныеДолга(Ссылка, "Увеличения"));
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Дата = НачалоДня(Дата);
	
КонецПроцедуры

Функция ПолучитьДанныеДолга(Документ, ВидОперацииСтрокой)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КорректировкаДолга.Должник#ВидОперации# КАК Должник,
	|	КорректировкаДолга.Валюта#ВидОперации# КАК Валюта,
	|	КорректировкаДолга.Сумма#ВидОперации# КАК Сумма,
	|	КорректировкаДолга.СрокИсполнения,
	|	КорректировкаДолга.Дата Как Период,
	|	КорректировкаДолга.Комментарий
	|ИЗ
	|	Документ.КорректировкаДолга КАК КорректировкаДолга
	|ГДЕ
	|	КорректировкаДолга.Ссылка = &Документ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#ВидОперации#", ВидОперацииСтрокой);
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка
	
КонецФункции
